# vim: ft=ruby
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "raggi/ale"
tap "sapcc/limesctl", "https://github.com/sapcc/limesctl.git"
tap "theseal/ssh-askpass"
brew "bash"
brew "bash-completion@2"
brew "brew-cask-completion"
brew "cdrtools"
brew "coreutils"
brew "direnv"
brew "python@3.9", link: true
brew "exa"
brew "gawk"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gopass"
brew "helm"
brew "htop"
brew "jing-trang"
brew "jq"
brew "launchctl-completion"
brew "libxml2"
brew "make"
brew "mas"
brew "mtr"
brew "mypy"
brew "mysql-client"
brew "nmap"
brew "node"
brew "open-completion"
brew "pass"
brew "pinentry-mac"
brew "pip-completion"
brew "pre-commit"
brew "pstree"
brew "ripgrep-all"
brew "shellcheck"
brew "shfmt"
brew "stern"
brew "tailscale"
brew "util-linux"
brew "watch"
brew "yadm"
brew "yamllint"
brew "sapcc/limesctl/limesctl"
brew "hudochenkov/sshpass/sshpass"
brew "raggi/ale/openssl-osx-ca"
brew "theseal/ssh-askpass/ssh-askpass"
cask "drawio"
cask "font-powerline-symbols"
cask "font-terminess-ttf-nerd-font"
cask "font-terminus"
cask "iterm2"
cask "macvim"
cask "meld"
cask "rowanj-gitx"
mas "Slack", id: 803453959
